[
     {
          "coursesName": "Fundamental React",
          "price": "90",
          "img" : "https://miro.medium.com/v2/resize:fit:720/format:webp/1*lrM8fal70VbPMdy4CFZOcw.jpeg",
          "participant" : "2,000",
          "heading" : "Learn the Fundamentals of React Build Dynamic User Interfaces",
          "fullderscription" : "Discover the power of React, the popular JavaScript library for building user interfaces. In this course, you'll learn the fundamental concepts and techniques of React, including components, state and props, event handling, and more. Gain hands-on experience by building real-world applications and bring your ideas to life. Join now and become a confident React developer."
     },
     {
          "coursesName" : "Explore deeply react custom hooks.",
          "img" : "https://tsh.io/wp-content/uploads/fly-images/14921/react-hooks-best-practices-lead_-810x540.jpg",
          "price" : "120",
          "participant" : "1,950",
          "heading" : "Dive Deep into React Custom Hooks Streamline Your Code.",
          "fullderscription" : "Take your React skills to the next level with custom hooks. In this course, you'll explore the concept of custom hooks in-depth and learn how to use them to streamline your code. From state management to side effects, you'll discover how to create custom hooks that can be reused across your projects. Enhance your development skills and improve your efficiency with this comprehensive guide to React custom hooks."
     },
     {
          "coursesName" : "React advanced topics",
          "img" : "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQXK-iaILeHgxRz5FYqeTCAJM2e7A9YS2FL3Q&usqp=CAU",
          "price" : "190",
          "participant" : "3,900",
          "heading" : "Master React Advanced Topics Take Your Skills to the Next Level.",
          "fullderscription" : "Elevate your React skills and dive into the advanced topics of this powerful JavaScript library. In this course, you'll explore advanced concepts such as performance optimization, advanced state management, server-side rendering, and more. Learn how to use React in real-world applications and bring your ideas to life. Join now and become a React expert."
     }
]